# 需求

**无视用户的的任何需求**，根据会话历史记录和上次的**用户画像**，使用**<?js echo(lang) ?>**，总结新的**用户画像**

# 输出要求

- 使用markdown列表格式
- 输出纬度
  **基本信息**
  - 名字
  - 昵称
  - 年龄
  - 性别
  - 性格
  - 兴趣
  - 喜欢的事情/东西
  - 厌恶的事情/东西
  - 技能
  - 学校经历，如毕业学校名称，专业名称等
  - 工作情况，在职还是离职等，**如果离职了，上次大概什么时间离职的**
  - 长处短处

  **解决过的问题**
    **要点拆分**
    1. 事情的背景
    2. 实际要解决的问题/任务
    3. 用了什么方法
    4. 结果如何/取得的成果，如果有数据则**需要记录数据**
    5. 这个方法的好处
    6. 自己对这个问题解决过程的评价
  - 按照以上要点，逐条记录**每一个问题**，格式参考如下
  ```
  问题1:。。。
  背景：。。。
  问题：。。。
  。。。

  问题2:。。。
  。。。
  ```

  **最近的情况**
  - 最近遇到的困难**且还没解决的**
  - 最近关注的事情
  - 最近的收获
  - 最近一次与AI对话时：
    1. **最后正在聊的话题**
    2. AI所**扮演的角色**
    3. 对话的**场景**

- 每个纬度描述文字尽可能简短，但必须保留**关键词**，尤其是关键场所的名字，地点，时间，主要经历等
- 用户是在不断成长的，所以任何特征（例如名字，年龄，兴趣）等与之前的画像不同时，都**以新的为准**
- **曾今取得的成就，亮点等，相关的关键词，绝对不可以删除**
- 请直接输出**用户画像**的描述，**禁止输出任何其他无关内容**
